wolfSSL/wolfBoot/hal/nrf5340.h
/* nrf5340.h
 *
 * Copyright (C) 2026 wolfSSL Inc.
 *
 * This file is part of wolfBoot.
 *
 * wolfBoot is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 3 of the License, or
 * (at your option) any later version.
 *
 * wolfBoot is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1335, USA
 */

#ifndef _HAL_NRF5340_H_
#define _HAL_NRF5340_H_

#if !defined(TARGET_nRF5340_net) && !(defined(TZEN) && defined(NONSECURE_APP))
#   define TZ_SECURE() (1)
#else
#   define TZ_SECURE() (0)
#endif

/* Build-time gate for secure or non-secure peripherals.
 * At boot-time peripherals are secure */
#ifdef TARGET_nrf5340_net
    /* Network core */
    #undef QSPI_FLASH /* not supported on network core */
    #define CORE_STR "net"
#else
    /* Application core */
    #define TARGET_nrf5340_app
    #define CORE_STR "app"
#endif

/* Clock */
#ifdef TARGET_nrf5340_app
    #define CPU_CLOCK 128000000UL /* 128MHz */
#else
    #define CPU_CLOCK  64000000UL /*  64MHz */
#endif

/* Flash */
#define FLASH_PAGESZ_APP (4096)            /* 4KB Page */
#define FLASH_BASE_APP   (0x00000000)
#define FLASH_SIZE_APP   (1024UL * 1024UL) /* 1MB Flash */

#define FLASH_PAGESZ_NET (2048)            /* 2KB Page */
#define FLASH_BASE_NET   (0x01000000)
#define FLASH_SIZE_NET   (256UL * 1024UL)  /* 256KB Flash */

#ifdef TARGET_nrf5340_app
    #define FLASH_PAGE_SIZE FLASH_PAGESZ_APP
    #define FLASH_BASE_ADDR FLASH_BASE_APP
    #define FLASH_SIZE      FLASH_SIZE_APP
#else
    #define FLASH_PAGE_SIZE FLASH_PAGESZ_NET
    #define FLASH_BASE_ADDR FLASH_BASE_NET
    #define FLASH_SIZE      FLASH_SIZE_NET
#endif

/* Assembly helpers */
#define DMB() __asm__ volatile ("dmb")
#define DSB() __asm__ volatile ("dsb" ::: "memory")
#define ISB() __asm__ volatile ("isb")
#define NOP() __asm__ volatile ("nop")

void sleep_us(uint32_t usec);

/* PSEL Port (bit 5) - Used for various PSEL (UART,SPI,QSPI,I2C,NFC) */
#define PSEL_PORT(n)         (((n) & 0x1) << 5)

/* Domain Configuration */
#ifdef TARGET_nrf5340_app
    #if TZ_SECURE()
        #define DCNF_BASE (0x50000000)
    #else
        #define DCNF_BASE (0x40000000)
    #endif
#else
    #define DCNF_BASE     (0x41000000)
#endif

#define DCNF_CPUID         *((volatile uint32_t *)(DCNF_BASE + 0x420))
#ifdef TARGET_nrf5340_app
    /* allows blocking of network cores ability to resources on application core */
    #define DCNF_EXTPERI0_PROT *((volatile uint32_t *)(DCNF_BASE + 0x440))
    #define DCNF_EXTRAM0_PROT  *((volatile uint32_t *)(DCNF_BASE + 0x460)) /* Eight 64KB slaves bit 0=0x20000000-0x20010000 (64KB) */
    #define DCNF_EXTCODE0_PROT *((volatile uint32_t *)(DCNF_BASE + 0x480))
#endif

#ifdef TARGET_nrf5340_app
    /* SPU */
    #define SPU_BASE 0x50003000UL

    #define SPU_EXTDOMAIN_PERM(n)   *((volatile uint32_t *)(SPU_BASE + 0x440 + (((n) & 0x0) * 0x4)))
    #define SPU_EXTDOMAIN_PERM_SECATTR_NONSECURE  0
    #define SPU_EXTDOMAIN_PERM_SECATTR_SECURE     (1 << 4)
    #define SPU_EXTDOMAIN_PERM_UNLOCK             0
    #define SPU_EXTDOMAIN_PERM_LOCK               (1 << 8)
    #define SPU_EXTDOMAIN_PERM_SECUREMAPPING_MASK (0x3)

    #define SPU_GPIOPORT_PERM(n) (*(volatile uint32_t *)(SPU_BASE + 0x4C0 + ((n) & 0x1) * 0x8))
    #define SPU_GPIOPORT_LOCK(n) (*(volatile uint32_t *)(SPU_BASE + 0x4C4 + ((n) & 0x1) * 0x8))

    #define SPU_FLASH_BLOCK_SIZE (16 * 1024)
    #define SPU_RAM_BLOCK_SIZE   (8 * 1024)

    #define SPU_FLASHNSC_REGION(n)   (*(volatile uint32_t *)(SPU_BASE + 0x500 + ((n) & 0x1) * 0x8))
    #define SPU_FLASHNSC_REGION_MASK 0x0000003F
    #define SPU_FLASHNSC_REGION_LOCK (1 << 8)

    #define SPU_FLASHNSC_SIZE(n)     (*(volatile uint32_t *)(SPU_BASE + 0x504 + ((n) & 0x1) * 0x8))
    #define SPU_FLASHNSC_SIZE_MASK   0x0000000F
    #define SPU_FLASHNSC_SIZE_LOCK   (1 << 8)

    #define SPU_RAMNSC_REGION(n)     (*(volatile uint32_t *)(SPU_BASE + 0x540 + ((n) & 0x1) * 0x8))
    #define SPU_RAMNSC_REGION_MASK   0x0000003F
    #define SPU_RAMNSC_REGION_LOCK   (1 << 8)

    #define SPU_RAMNSC_SIZE(n)       (*(volatile uint32_t *)(SPU_BASE + 0x544 + ((n) & 0x1) * 0x8))
    #define SPU_RAMNSC_SIZE_MASK     0x0000000F
    #define SPU_RAMNSC_SIZE_LOCK     (1 << 8)

    #define SPU_FLASHREGION_PERM(n)      (*(volatile uint32_t *)(SPU_BASE + 0x600 + ((n) & 0x3F) * 0x4))
    #define SPU_FLASHREGION_PERM_EXEC    (1 << 0) /* Allow instruction fetches from flash region */
    #define SPU_FLASHREGION_PERM_WRITE   (1 << 1) /* Allow write operation to region */
    #define SPU_FLASHREGION_PERM_READ    (1 << 2) /* Allow read operation from flash region */
    #define SPU_FLASHREGION_PERM_SECATTR (1 << 4) /* Flash region n security attribute is secure */
    #define SPU_FLASHREGION_PERM_LOCK    (1 << 8) /* The content of this register can't be changed until the next reset */

    #define SPU_RAMREGION_PERM(n)      (*(volatile uint32_t *)(SPU_BASE + 0x700 + ((n) & 0x3F) * 0x4))
    #define SPU_RAMREGION_PERM_EXEC    (1 << 0) /* Allow instruction fetches from RAM region */
    #define SPU_RAMREGION_PERM_WRITE   (1 << 1) /* Allow write operation to region */
    #define SPU_RAMREGION_PERM_READ    (1 << 2) /* Allow read operation from RAM region */
    #define SPU_RAMREGION_PERM_SECATTR (1 << 4) /* RAM region n security attribute is secure */
    #define SPU_RAMREGION_PERM_LOCK    (1 << 8) /* The content of this register can't be changed until the next reset */

    #define SPU_PERIPHID_PERM(n)                      (*(volatile uint32_t *)(SPU_BASE + 0x800 + ((n) & 0xFF) * 0x4))
    #define SPU_PERIPHID_PERM_SECUREMAPPING_MASK      0x00000003
    #define SPU_PERIPHID_PERM_SECUREMAPPING_NONSECURE (0 << 0)
    #define SPU_PERIPHID_PERM_SECUREMAPPING_SECURE    (1 << 0)
    #define SPU_PERIPHID_PERM_SECUREMAPPING_USERSEL   (2 << 0)
    #define SPU_PERIPHID_PERM_SECUREMAPPING_SPLIT     (3 << 0)
    #define SPU_PERIPHID_PERM_DMA_MASK                0x0000000C
    #define SPU_PERIPHID_PERM_DMA_NODMA               (0 << 2)
    #define SPU_PERIPHID_PERM_DMA_NOSEPATTR           (1 << 2)
    #define SPU_PERIPHID_PERM_DMA_SEPATTR             (2 << 2)
    #define SPU_PERIPHID_PERM_SECATTR                 (1 << 4)
    #define SPU_PERIPHID_PERM_DMASEC                  (1 << 5)
    #define SPU_PERIPHID_PERM_LOCK                    (1 << 8)
    #define SPU_PERIPHID_PERM_PRESENT                 (1 << 31)
#endif

/* UICR */
#ifdef TARGET_nrf5340_app
    #define UICR_BASE (0x00FF8000UL)
#else
    #define UICR_BASE (0x01FF8000UL)
#endif
#define UICR_USER (UICR_BASE)
#define UICR_APPROTECT       (*(volatile uint32_t *)(UICR_BASE + 0x000))
#define UICR_SECUREAPPROTECT (*(volatile uint32_t *)(UICR_BASE + 0x01C))
#define UICR_OTP             (UICR_BASE + 0x100)

