wolfSSL/wolfBoot/hal/nrf5340.h
/* CTRLAP */
#ifdef TARGET_nrf5340_app
    #define CTRLAP_BASE (0x50006000)
#else
    #define CTRLAP_BASE (0x41006000)
#endif
#define CTRLAP_APPROTECT_LOCK          (*(volatile uint32_t *)(CTRLAP_BASE + 0x540))
#define CTRLAP_APPROTECT_DISABLE       (*(volatile uint32_t *)(CTRLAP_BASE + 0x544))
#define CTRLAP_SECUREAPPROTECT_LOCK    (*(volatile uint32_t *)(CTRLAP_BASE + 0x548))
#define CTRLAP_SECUREAPPROTECT_DISABLE (*(volatile uint32_t *)(CTRLAP_BASE + 0x54C))

/* Reset */
#ifdef TARGET_nrf5340_app
    #if TZ_SECURE()
        #define RESET_BASE (0x50005000)
    #else
        #define RESET_BASE (0x40005000)
    #endif
#else
    #define RESET_BASE     (0x41005000)
#endif
#define NETWORK_RESETREAS *((volatile uint32_t *)(RESET_BASE + 0x400))
#define NETWORK_RESETREAS_RESETPIN  (1 << 0)
#define NETWORK_RESETREAS_DOG0      (1 << 1) /* watchdog timer 0 */
#define NETWORK_RESETREAS_SREQ      (1 << 3) /* soft reset */
#define NETWORK_RESETREAS_OFF       (1 << 5) /* wake from off */
#define NETWORK_RESETREAS_MFORCEOFF (1 << 23)
#define NETWORK_FORCEOFF  *((volatile uint32_t *)(RESET_BASE + 0x614))
#define NETWORK_FORCEOFF_RELEASE 0
#define NETWORK_FORCEOFF_HOLD    1
#define NETWORK_ERRATA_161 *((volatile uint32_t *)(RESET_BASE + 0x618))


/* Non-volatile memory controller */
#define KMU_NVMC_PERIPHID 57

#ifdef TARGET_nrf5340_app
    #if TZ_SECURE()
        #define NVMC_BASE (0x50039000)
    #else
        #define NVMC_BASE (0x40039000)
    #endif
#else
    #define NVMC_BASE     (0x41080000)
#endif
#define NVMC_READY       *((volatile uint32_t *)(NVMC_BASE + 0x400))
#define NVMC_READYNEXT   *((volatile uint32_t *)(NVMC_BASE + 0x408))
#define NVMC_CONFIG      *((volatile uint32_t *)(NVMC_BASE + 0x504))
#define NVMC_CONFIGNS    *((volatile uint32_t *)(NVMC_BASE + 0x584))
#define NVMC_WRITEUICRNS *((volatile uint32_t *)(NVMC_BASE + 0x588)) /* User information configuration registers (UICR) */

#define NVMC_CONFIG_REN  0 /* read only access */
#define NVMC_CONFIG_WEN  1 /* write enable */
#define NVMC_CONFIG_EEN  2 /* erase enable */
#define NVMC_CONFIG_PEE  3 /* partial erase enable - secure only */

#define NVMC_WRITEUICRNS_SET 1
#define NVMC_WRITEUICRNS_KEY 0xAFBE5A70

/* Clock control */
#ifdef TARGET_nrf5340_app
    #if TZ_SECURE()
        #define CLOCK_BASE  (0x50005000)
    #else
        #define CLOCK_BASE  (0x40005000)
    #endif
#else
    #define CLOCK_BASE      (0x41005000) /* network core */
#endif
#define CLOCK_HFCLKSTART    *((volatile uint32_t *)(CLOCK_BASE + 0x000))
#define CLOCK_HFCLKSTOP     *((volatile uint32_t *)(CLOCK_BASE + 0x004))
#define CLOCK_HFCLKSTARTED  *((volatile uint32_t *)(CLOCK_BASE + 0x100))
#define CLOCK_HFCLKSTAT     *((volatile uint32_t *)(CLOCK_BASE + 0x40C))
#define CLOCK_HFCLKSRC      *((volatile uint32_t *)(CLOCK_BASE + 0x514))
#define CLOCK_HFCLKSRC_HFXO 1
#define CLOCK_HFCLKCTRL     *((volatile uint32_t *)(CLOCK_BASE + 0x558))
#define CLOCK_HFCLKCTRL_DIV1 0
#define CLOCK_HFCLKCTRL_DIV2 1

#define CLOCK_HFCLK192MSTART     *((volatile uint32_t *)(CLOCK_BASE + 0x020))
#define CLOCK_HFCLK192MSTOP      *((volatile uint32_t *)(CLOCK_BASE + 0x024))
#define CLOCK_HFCLK192MSTARTED   *((volatile uint32_t *)(CLOCK_BASE + 0x124))
#define CLOCK_HFCLK192MSRC       *((volatile uint32_t *)(CLOCK_BASE + 0x580))
#define CLOCK_HFCLK192MSRC_HFXO  1
#define CLOCK_HFCLK192MCTRL      *((volatile uint32_t *)(CLOCK_BASE + 0x5B8))
#define CLOCK_HFCLK192MCTRL_DIV1 0
#define CLOCK_HFCLK192MCTRL_DIV2 1
#define CLOCK_HFCLK192MCTRL_DIV4 2

/* Low frequency: 32.768 kHz */
#define CLOCK_LFCLKSTART      *((volatile uint32_t *)(CLOCK_BASE + 0x008))
#define CLOCK_LFCLKSTOP       *((volatile uint32_t *)(CLOCK_BASE + 0x00C))
#define CLOCK_LFCLKSTARTED    *((volatile uint32_t *)(CLOCK_BASE + 0x104))
#define CLOCK_LFCLKSRC        *((volatile uint32_t *)(CLOCK_BASE + 0x518))
#define CLOCK_LFCLKSRC_LFULP  0 /* ultra-low power RC oscillator */
#define CLOCK_LFCLKSRC_LFRC   1 /* RC oscillator */
#define CLOCK_LFCLKSRC_LFXO   2 /* crystal oscillator */
#define CLOCK_LFCLKSRC_LFSYNT 3 /* synthesized from HFCLK */


/* GPIO Port (0-1) */
#define GPIO_PERIPHID 66

#ifdef TARGET_nrf5340_app
    #if TZ_SECURE()
        #define GPIO_BASE(n) (0x50842500 + (((n) & 0x1) * 0x300))
    #else
        #define GPIO_BASE(n) (0x40842500 + (((n) & 0x1) * 0x300))
    #endif
#else
    #define GPIO_BASE(n)     (0x418C0500 + (((n) & 0x1) * 0x300))
#endif
#define GPIO_OUT(n)          *((volatile uint32_t *)(GPIO_BASE(n) + 0x004))
#define GPIO_OUTSET(n)       *((volatile uint32_t *)(GPIO_BASE(n) + 0x008))
#define GPIO_OUTCLR(n)       *((volatile uint32_t *)(GPIO_BASE(n) + 0x00C))
#define GPIO_IN(n)           *((volatile uint32_t *)(GPIO_BASE(n) + 0x010))
#define GPIO_DIRSET(n)       *((volatile uint32_t *)(GPIO_BASE(n) + 0x018))
#define GPIO_PIN_CNF(n,p)    *((volatile uint32_t *)(GPIO_BASE(n) + 0x200 + ((p) * 0x4)))

#define GPIO_CNF_IN          0
#define GPIO_CNF_IN_DIS      2
#define GPIO_CNF_OUT         3
#define GPIO_CNF_PULL_DIS    0
#define GPIO_CNF_PULL_UP     (3UL << 2)
#define GPIO_CNF_PULL_DOWN   (1UL << 2)
#define GPIO_CNF_STD_DRIVE   0
#define GPIO_CNF_HIGH_DRIVE  (3UL << 8)
#define GPIO_CNF_SENSE_NONE  0
#define GPIO_CNF_MCUSEL(n)   (((n) & 0x7) << 28)

/* UART (0-1) */
#define SERIAL0_PERIPHID 8
#define SERIAL1_PERIPHID 9
#define SERIAL2_PERIPHID 11
#define SERIAL3_PERIPHID 12

#ifdef TARGET_nrf5340_app
    #if TZ_SECURE()
        #define UART_BASE(n) (0x50008000 + (((n) & 0x1) * 0x1000))
    #else
        #define UART_BASE(n) (0x40008000 + (((n) & 0x1) * 0x1000))
    #endif
#else
    #define UART_BASE(n)     (0x41013000) /* UARTE0 only */

#endif
#define UART_TASK_STARTTX(n) *((volatile uint32_t *)(UART_BASE(n) + 0x008))
#define UART_TASK_STOPTX(n)  *((volatile uint32_t *)(UART_BASE(n) + 0x00C))
#define UART_EVENT_TXDRDY(n) *((volatile uint32_t *)(UART_BASE(n) + 0x11C))
#define UART_EVENT_ENDTX(n)  *((volatile uint32_t *)(UART_BASE(n) + 0x120))
#define UART_ENABLE(n)       *((volatile uint32_t *)(UART_BASE(n) + 0x500))
#define UART_PSEL_TXD(n)     *((volatile uint32_t *)(UART_BASE(n) + 0x50C))
#define UART_PSEL_RXD(n)     *((volatile uint32_t *)(UART_BASE(n) + 0x514))
#define UART_BAUDRATE(n)     *((volatile uint32_t *)(UART_BASE(n) + 0x524))
#define UART_TXD_PTR(n)      *((volatile uint32_t *)(UART_BASE(n) + 0x544))
#define UART_TXD_MAXCOUNT(n) *((volatile uint32_t *)(UART_BASE(n) + 0x548))
#define UART_CONFIG(n)       *((volatile uint32_t *)(UART_BASE(n) + 0x56C))

#define BAUD_115200 0x01D60000UL

void uart_write_sz(const char* c, unsigned int sz);

/* SPI (0-2) */
#ifdef TARGET_nrf5340_app
    #if TZ_SECURE()
        #define SPI_BASE(n)  (0x50008000 + (((n) & 0x3) * 0x1000))
    #else
        #define SPI_BASE(n)  (0x40008000 + (((n) & 0x3) * 0x1000))
    #endif
#else
    #define SPI_BASE(n)      (0x41013000) /* SPIM0 only */
#endif
#define SPI_TASKS_START(n)   *((volatile uint32_t *)(SPI_BASE(n) + 0x010))
#define SPI_TASKS_STOP(n)    *((volatile uint32_t *)(SPI_BASE(n) + 0x014))
#define SPI_EVENTS_ENDRX(n)  *((volatile uint32_t *)(SPI_BASE(n) + 0x110))
#define SPI_EVENTS_END(n)    *((volatile uint32_t *)(SPI_BASE(n) + 0x118))
#define SPI_EVENTS_ENDTX(n)  *((volatile uint32_t *)(SPI_BASE(n) + 0x120))
#define SPI_EV_RDY(n)        *((volatile uint32_t *)(SPI_BASE(n) + 0x108))
#define SPI_INTENSET(n)      *((volatile uint32_t *)(SPI_BASE(n) + 0x304))
#define SPI_INTENCLR(n)      *((volatile uint32_t *)(SPI_BASE(n) + 0x308))
#define SPI_ENABLE(n)        *((volatile uint32_t *)(SPI_BASE(n) + 0x500))
#define SPI_PSEL_SCK(n)      *((volatile uint32_t *)(SPI_BASE(n) + 0x508))
#define SPI_PSEL_MOSI(n)     *((volatile uint32_t *)(SPI_BASE(n) + 0x50C))
#define SPI_PSEL_MISO(n)     *((volatile uint32_t *)(SPI_BASE(n) + 0x510))
#define SPI_RXDATA(n)        *((volatile uint32_t *)(SPI_BASE(n) + 0x518))
#define SPI_TXDATA(n)        *((volatile uint32_t *)(SPI_BASE(n) + 0x51C))
#define SPI_FREQUENCY(n)     *((volatile uint32_t *)(SPI_BASE(n) + 0x524))
#define SPI_CONFIG(n)        *((volatile uint32_t *)(SPI_BASE(n) + 0x554))

