wolfSSL/wolfBoot/hal/nrf5340.h
#define SPI_FREQ_K125 0x02000000
#define SPI_FREQ_K250 0x04000000
#define SPI_FREQ_K500 0x08000000
#define SPI_FREQ_M1   0x10000000
#define SPI_FREQ_M2   0x20000000
#define SPI_FREQ_M4   0x40000000
#define SPI_FREQ_M8   0x80000000
#define SPI_FREQ_M16  0x0A000000
#define SPI_FREQ_M32  0x14000000

/* QSPI */
#ifdef TARGET_nrf5340_app
    #define QSPI_PERIPHID 43

    #if TZ_SECURE()
        #define QSPI_BASE         (0x5002B000)
    #else
        #define QSPI_BASE         (0x4002B000)
    #endif
    #define QSPI_TASKS_ACTIVATE   *((volatile uint32_t *)(QSPI_BASE + 0x000))
    #define QSPI_TASKS_READSTART  *((volatile uint32_t *)(QSPI_BASE + 0x004))
    #define QSPI_TASKS_WRITESTART *((volatile uint32_t *)(QSPI_BASE + 0x008))
    #define QSPI_TASKS_ERASESTART *((volatile uint32_t *)(QSPI_BASE + 0x00C))
    #define QSPI_TASKS_DEACTIVATE *((volatile uint32_t *)(QSPI_BASE + 0x010))
    #define QSPI_EVENTS_READY     *((volatile uint32_t *)(QSPI_BASE + 0x100))

    #define QSPI_INTEN            *((volatile uint32_t *)(QSPI_BASE + 0x300))
    #define QSPI_INTENSET         *((volatile uint32_t *)(QSPI_BASE + 0x304))
    #define QSPI_INTENCLR         *((volatile uint32_t *)(QSPI_BASE + 0x308))

    #define QSPI_ENABLE           *((volatile uint32_t *)(QSPI_BASE + 0x500))

    #define QSPI_READ_SRC         *((volatile uint32_t *)(QSPI_BASE + 0x504))
    #define QSPI_READ_DST         *((volatile uint32_t *)(QSPI_BASE + 0x508))
    #define QSPI_READ_CNT         *((volatile uint32_t *)(QSPI_BASE + 0x50C))
    #define QSPI_WRITE_DST        *((volatile uint32_t *)(QSPI_BASE + 0x510))
    #define QSPI_WRITE_SRC        *((volatile uint32_t *)(QSPI_BASE + 0x514))
    #define QSPI_WRITE_CNT        *((volatile uint32_t *)(QSPI_BASE + 0x518))
    #define QSPI_ERASE_PTR        *((volatile uint32_t *)(QSPI_BASE + 0x51C))
    #define QSPI_ERASE_LEN        *((volatile uint32_t *)(QSPI_BASE + 0x520))

    #define QSPI_PSEL_SCK         *((volatile uint32_t *)(QSPI_BASE + 0x524))
    #define QSPI_PSEL_CSN         *((volatile uint32_t *)(QSPI_BASE + 0x528))
    #define QSPI_PSEL_IO0         *((volatile uint32_t *)(QSPI_BASE + 0x530))
    #define QSPI_PSEL_IO1         *((volatile uint32_t *)(QSPI_BASE + 0x534))
    #define QSPI_PSEL_IO2         *((volatile uint32_t *)(QSPI_BASE + 0x538))
    #define QSPI_PSEL_IO3         *((volatile uint32_t *)(QSPI_BASE + 0x53C))

    #define QSPI_IFCONFIG0        *((volatile uint32_t *)(QSPI_BASE + 0x544))
    #define QSPI_IFCONFIG1        *((volatile uint32_t *)(QSPI_BASE + 0x600))

    #define QSPI_STATUS           *((volatile uint32_t *)(QSPI_BASE + 0x604))
    #define QSPI_ADDRCONF         *((volatile uint32_t *)(QSPI_BASE + 0x624))
    #define QSPI_CINSTRCONF       *((volatile uint32_t *)(QSPI_BASE + 0x634))
    #define QSPI_CINSTRDAT0       *((volatile uint32_t *)(QSPI_BASE + 0x638))
    #define QSPI_CINSTRDAT1       *((volatile uint32_t *)(QSPI_BASE + 0x63C))
    #define QSPI_IFTIMING         *((volatile uint32_t *)(QSPI_BASE + 0x640))

    #define QSPI_IFCONFIG0_READOC_MASK     0x7
    #define QSPI_IFCONFIG0_READOC_FASTREAD (0) /* opcode 0x0B */
    #define QSPI_IFCONFIG0_READOC_READ2O   (1) /* opcode 0x3B */
    #define QSPI_IFCONFIG0_READOC_READ2IO  (2) /* opcode 0xBB */
    #define QSPI_IFCONFIG0_READOC_READ4O   (3) /* opcode 0x6B */
    #define QSPI_IFCONFIG0_READOC_READ4IO  (4) /* opcode 0xEB */
    #define QSPI_IFCONFIG0_WRITEOC_MASK    ((0x7) << 3)
    #define QSPI_IFCONFIG0_WRITEOC_PP      ((0) << 3) /* opcode 0x02 */
    #define QSPI_IFCONFIG0_WRITEOC_PP2O    ((1) << 3) /* opcode 0xA2 */
    #define QSPI_IFCONFIG0_WRITEOC_PP4O    ((2) << 3) /* opcode 0x32 */
    #define QSPI_IFCONFIG0_WRITEOC_PP4IO   ((3) << 3) /* opcode 0x38 */
    #define QSPI_IFCONFIG0_ADDRMODE_24BIT  ((0) << 6)
    #define QSPI_IFCONFIG0_ADDRMODE_32BIT  ((1) << 6)
    #define QSPI_IFCONFIG0_DPMENABLE       ((1) << 7)
    #define QSPI_IFCONFIG0_PPSIZE_256      ((0) << 12)
    #define QSPI_IFCONFIG0_PPSIZE_512      ((1) << 12)

    #define QSPI_IFCONFIG1_SCKDELAY_MASK   0xFF
    #define QSPI_IFCONFIG1_SCKDELAY(n)     ((n) & QSPI_IFCONFIG1_SCKDELAY_MASK)
    #define QSPI_IFCONFIG1_SPIMODE0        0
    #define QSPI_IFCONFIG1_SPIMODE3        (1UL << 25)
    #define QSPI_IFCONFIG1_SCKFREQ_MASK    ((0xF) << 28)
    #define QSPI_IFCONFIG1_SCKFREQ(n)      (((n) & 0xF) << 28)

    #define QSPI_CINSTRCONF_OPCODE(n)      ((n) & 0xFF)
    #define QSPI_CINSTRCONF_LENGTH(n)      (((n) & 0xF) << 8)
    #define QSPI_CINSTRCONF_LIO2           (1 << 12)
    #define QSPI_CINSTRCONF_LIO3           (1 << 13)
    #define QSPI_CINSTRCONF_WREN           (1 << 15) /* send WREN opcode 0x6 before */

    #define QSPI_IFTIMING_RXDELAY(n)       (((n) & 0x7) << 8)
#else
    /* Disable QSPI Flash */
    #undef QSPI_FLASH
#endif

/* CryptoCell */
#ifdef TARGET_nrf5340_app
    #define CRYPTOCELL_BASE   0x50844000
    #define CRYPTOCELL_ENABLE (*(volatile uint32_t *)(CRYPTOCELL_BASE + 0x500))

    #define FICR_BASE          0x00FF0000
    #define FICR_TRNG90B_ROSC1 (*(volatile uint32_t *)(FICR_BASE + 0xC10))

    #define CC_RNG_BASE               0x50845000
    #define CC_RNG_ISR                (*(volatile uint32_t *)(CC_RNG_BASE + 0x104))
    #define CC_RNG_ICR                (*(volatile uint32_t *)(CC_RNG_BASE + 0x108))
    #define CC_RNG_TRNG_CONFIG        (*(volatile uint32_t *)(CC_RNG_BASE + 0x10C))
    #define CC_RNG_TRNG_VALID         (*(volatile uint32_t *)(CC_RNG_BASE + 0x110))
    #define CC_RNG_EHR_DATA(n)        (*(volatile uint32_t *)(CC_RNG_BASE + 0x114 + (n) * 0x4))
    #define CC_RNG_EHR_DATA_LEN       6
    #define CC_RNG_NOISE_SOURCE       (*(volatile uint32_t *)(CC_RNG_BASE + 0x12C))
    #define CC_RNG_SAMPLE_CNT         (*(volatile uint32_t *)(CC_RNG_BASE + 0x130))
    #define CC_RNG_AUTOCORR_STATISTIC (*(volatile uint32_t *)(CC_RNG_BASE + 0x134))
    #define CC_RNG_TRNG_DEBUG         (*(volatile uint32_t *)(CC_RNG_BASE + 0x138))
    #define CC_RNG_SW_RESET           (*(volatile uint32_t *)(CC_RNG_BASE + 0x140))
    #define CC_RNG_BUSY               (*(volatile uint32_t *)(CC_RNG_BASE + 0x1B8))
    #define CC_RNG_TRNG_RESET         (*(volatile uint32_t *)(CC_RNG_BASE + 0x1BC))
    #define CC_RNG_HW_FLAGS           (*(volatile uint32_t *)(CC_RNG_BASE + 0x1C0))
    #define CC_RNG_CLK                (*(volatile uint32_t *)(CC_RNG_BASE + 0x1C4))
    #define CC_RNG_DMA                (*(volatile uint32_t *)(CC_RNG_BASE + 0x1C8))
    #define CC_RNG_DMA_ROSC_LEN       (*(volatile uint32_t *)(CC_RNG_BASE + 0x1CC))
    #define CC_RNG_DMA_SRAM_ADDR      (*(volatile uint32_t *)(CC_RNG_BASE + 0x1D0))
    #define CC_RNG_DMA_SAMPLES_NUM    (*(volatile uint32_t *)(CC_RNG_BASE + 0x1D4))
    #define CC_RNG_WATCHDOG_VAL       (*(volatile uint32_t *)(CC_RNG_BASE + 0x1D8))
    #define CC_RNG_DMA_BUSY           (*(volatile uint32_t *)(CC_RNG_BASE + 0x1DC))
#endif

/* interprocessor communication (IPC) peripheral */
#ifdef TARGET_nrf5340_app
    #if TZ_SECURE()
    #define IPC_BASE      (0x5002A000)
    #else
    #define IPC_BASE      (0x4002A000)
    #endif
#else
    #define IPC_BASE      (0x41012000) /* network core */
#endif
#define IPC_TASKS_SEND(n)      *((volatile uint32_t *)(IPC_BASE + 0x000 + (((n) & 0xF) * 0x4)))
#define IPC_SUBSCRIBE_SEND(n)  *((volatile uint32_t *)(IPC_BASE + 0x080 + (((n) & 0xF) * 0x4)))
#define IPC_EVENTS_RECEIVE(n)  *((volatile uint32_t *)(IPC_BASE + 0x100 + (((n) & 0xF) * 0x4)))
#define IPC_PUBLISH_RECEIVE(n) *((volatile uint32_t *)(IPC_BASE + 0x180 + (((n) & 0xF) * 0x4)))
#define IPC_SEND_CNF(n)        *((volatile uint32_t *)(IPC_BASE + 0x510 + (((n) & 0xF) * 0x4)))
#define IPC_RECEIVE_CNF(n)     *((volatile uint32_t *)(IPC_BASE + 0x590 + (((n) & 0xF) * 0x4)))
#define IPC_GPMEM(n)           *((volatile uint32_t *)(IPC_BASE + 0x610 + (((n) & 0x1) * 0x4)))

/* RTC - uses LFCLK - 24-bit counter/compare */
#define RTC0_PERIPHID 20
#define RTC1_PERIPHID 21

#ifdef TARGET_nrf5340_app
    #if TZ_SECURE()
    #define RTC_BASE(n)     ((0x50014000) + (((n) & 0x1) * 0x1000))
    #else
    #define RTC_BASE(n)     ((0x40014000) + (((n) & 0x1) * 0x1000))
    #endif
#else
    #define RTC_BASE(n)     (0x41011000) /* network core */
#endif
#define RTC_START(n)        *((volatile uint32_t *)(RTC_BASE(n) + 0x000))
#define RTC_STOP(n)         *((volatile uint32_t *)(RTC_BASE(n) + 0x004))
#define RTC_CLEAR(n)        *((volatile uint32_t *)(RTC_BASE(n) + 0x008))
#define RTC_EVENT_TICK(n)   *((volatile uint32_t *)(RTC_BASE(n) + 0x100))
#define RTC_EVENT_OVRFLW(n) *((volatile uint32_t *)(RTC_BASE(n) + 0x104))
#define RTC_EVENT_CC(n,i)   *((volatile uint32_t *)(RTC_BASE(n) + 0x140 + ((i) & 0x3) * 0x4))
#define RTC_EVTENSET(n)     *((volatile uint32_t *)(RTC_BASE(n) + 0x344))
#define RTC_EVTENSET_TICK   (1 << 0)
#define RTC_EVTENSET_OVRFLW (1 << 1)
#define RTC_EVTENSET_CC0    (1 << 16)
#define RTC_EVTENSET_CC1    (1 << 17)
#define RTC_EVTENSET_CC2    (1 << 18)
#define RTC_EVTENSET_CC3    (1 << 19)
#define RTC_COUNTER(n)      *((volatile uint32_t *)(RTC_BASE(n) + 0x504))
#define RTC_PRESCALER(n)    *((volatile uint32_t *)(RTC_BASE(n) + 0x508)) /* default=0 or 32768 per second (12-bit) up to 0xFFF */
#define RTC_CC(n,i)         *((volatile uint32_t *)(RTC_BASE(n) + 0x540 + ((i) & 0x3) * 0x4))
#define RTC_OVERFLOW        0xFFFFFFUL


#endif /* !_HAL_NRF5340_H_ */
